{"date":"2009-12-11 19:30:15","content":"I've noticed a worrying trend. So books are going digital, great! I can supplement my library of books with digital editions that are easier to carry with me everywhere I go and don't cost the life of a tree. So why charge more for the digital copy than the physical copy? If the paperback industry wants to survive then they are going to need to be smarter than overpricing the ebook editions. For instance, Waterstones charge £1.60 more for the ebook edition of New Moon than the paperback version! This will just force people to pirate digital versions of the book and then the industry will get even less money. A great solution can be taken from the new Star Trek film that comes bundled with a digital version (that can be copied to a smart phone, ipod or similar) when you buy the movie on blu-ray. So why not bundle the ebook version with every paperback copy? The book shop could provide a voucher code with each book where you could log onto a website like <a href=\"http:\/\/www.meeqi.com\/\">www.Meeqi.com<\/a> and get your digital version of the book for free. Or when you get to the checkout they could simply ask if you would like the digital edition for an additional £2.50. Waterstones would get £2.50 for each voucher they print (which would be £2.49 profit) and the customer would get a fairly priced ebook.\r\n\r\nWaterstones charge £1.60 more for the ebook edition of New Moon:\r\n<a href=\"http:\/\/www.waterstones.com\/waterstonesweb\/products\/stephenie+meyer\/stephenie+meyer\/new+moon+28ebook29\/6630872\/\">New Moon<\/a> by Stephenie Meyer costs £5.59 in <a href=\"http:\/\/www.waterstones.com\/waterstonesweb\/products\/stephenie+meyer\/stephenie+meyer\/new+moon+28ebook29\/6630872\/\">digital form<\/a>, but when you buy the <a href=\"http:\/\/www.waterstones.com\/waterstonesweb\/products\/stephenie+meyer\/new+moon\/5897465\/\">paperback version<\/a> it costs just £3.99. (Prices taken at the time of writing this blog)\r\n\r\n\r\n","title":"A Solution to Over Priced Ebooks","status":"publish","name":"a-solution-to-over-priced-ebooks","type":"","tags":["Ebook","Meeqi","Book"],"categories":["Reviews\/Experience"],"comments":[]}