{"date":"2009-03-03 00:35:58","content":"Wow, that was worth the wait. I don't think I've ever picked up so much knowledge in one day since college. Great organization and an all round brilliant day!\r\n\r\nHere's a summary of the talks I attended but I unfortunately had to miss talks by Scott MacVicar, David Axmark, Staurt Herbert and Stefan Koopmanschap. But I will be watching them when they are made available on the PHPUK website.\r\n\r\nTalk 1: \"Keynote\" by Aral Balkan\r\n\r\nAral kicked the talks off by going through the history of computing and some of the more humorous sides of where programming began with the \"ancient\" punch card programs of the early 1900's. He showed parallax scrolling with HTML\/CSS, an augmented reality program in flash and talked about the new swx format. He also offered his solution \"<a href=\"http:\/\/github.com\/aral\/gaebar\/tree\/master\">Gaebar<\/a>\" to the issue of Google not allowing you to save or backup your database from their cloud network. He also reminded us all about the <a href=\"http:\/\/en.wikipedia.org\/wiki\/Conway%27s_Game_of_Life\">Game of Life<\/a> which was first created in the 1970's and then showed us how he had used it within his companies logo. He really wanted to press the point that programming should be fun, really fun and if it's not then you should stop and figure out how to make it fun again.\r\n\r\nTalk 2: \"Sharding Architecures\" by David Soria Parra\r\n\r\nI really didn't take much away from this talk. It's possible that I missed the point but others that I spoke to felt the same. David talked about the problems of splitting a database across multiple servers and then needing to know what data is on what computer by use of an algorithm or lookup. This is a very real problem for companies which have a large database and have hundreds or more disk writes as to split a database across multiple computers. However he did have some good points and shared his experience on designing a system that would know where to look for user data by simply knowing the user id.\r\n\r\nTalk 3: \"Of Lambda Function Closures And Traits\" by Sabastian Bergmann\r\n\r\nI was intrigued by the traits and the magic method\/interceptor \"invoke\". I will definitely be installing PHP 5.3 and having a play with these new features. Unfortunately many of the questions that audience members asked about closures such as how to access global variables and closure recursion were not fully answered due to these still being in the development stage.\r\n\r\nTalk 4: \"PHP on Windows - The Undiscovered Country\" by Hank Janssen\r\n\r\nI really wasn't sure what to expect from this talk. Hank spoke about the division of Microsoft he was from, the \"Open Source Technology Center\". I was amazed to hear just how much money Microsoft were pouring into open source projects and improving the open source software in the windows platform. Hank explained how his divison of Microsoft have been busy rewriting, patching and optimizing PHP on the Windows platform in a bid to make it run faster than on Linux. I have to say that if it made economic sense to change to a windows server rather than buy two linux servers, I would! It would cost less each month after the inital cost of the windows install and would pruduce much less carbon.\r\n\r\nTalk 5: \"Flex and Air for PHP Programmers\" by Mihai Corlan\r\n\r\nEven though I'm not a big user of adobe products and their languages, I could see some immediate applications for Flex + Air. Mihai showed some code examples and showed several real world applications. I was especially interested in AMF and will be looking at this in detail.\r\n\r\nTalk 6: \"Security Centered Design - exploring the impact of human behavior\" by Chris Shiflett\r\n\r\nThis was a really entertaining talk on how humans interact with web sites. He showed several example videos and images of the effects of \"change blindness\" which cemented a \"best practice\" that we've been using for a while. He explained the use of login seals to help prevent phishing attacks (Which I thought was an awesome idea and really want to know why my bank hasn't got this facility!?). He gave some good examples of mislabeled\/misleading option names in software and on websites. One in particular was Apples air port that has the option for a \"closed network\" which just stops broadcasting the SSID. Many people could mistake this for securing the network which would infact be adding strong encryption.\r\n\r\nConclusions:\r\n\r\nAn excellent conference and will be booking my ticket for php2010 as soon as they become available!","title":"PHP UK Conference 2009","status":"publish","name":"beta-php-uk-conference-2009","type":"","tags":["windows","PHP","Aral Balkan","Soria Parra","Sharding","Sabastian Bergmann","Hank Janssen","Mihai Corlan","Chris Shiflett","PHP2009","phpuk"],"categories":["News","General\/Techie"],"comments":[]}