{"date":"2009-11-01 08:00:47","content":"Regular backups, we all know the score. If you don't make regular backups then you will lose data.\r\n\r\nIn recent years more and more of the big players are releasing bigger and cheaper cloud solutions. e.g. Amazon's <a href=\"http:\/\/aws.amazon.com\/ec2\/\">EC2<\/a> or Microsoft's <a href=\"http:\/\/www.microsoft.com\/azure\/\">Azure<\/a>. Clouds offer incredible scalability allowing you to go from needing no processing power to thousands of CPUs or a few megabytes of storage to terabytes without ever needing to upgrade your server. Unfortunately sometimes proper backup solutions are not put in place. After all it is no easy task to backup an entire data centre in a timely manor that doesn't impact upon the clouds performance. Even more than that the backup must be stored differently to the main cloud. For instance it's not a good idea to backup an Amazon EC2 cloud to another EC2 cloud. If someone found an exploitable flaw in the EC2 platform that meant they could wipe the cloud or the cloud itself failed and erased all it's data then the exact same thing could happen to the backup copy. A simple solution is to mirror your data between two cloud platforms. The perfect solution is to maintain a tape backup (or at least some kind of offline storage) of your data and keep it in geographically different place.\r\n\r\nCloud computers are not immune to failure, they are simply as good as the software running on them. Some good examples of massive irreversible data loss:\r\n\r\n<a href=\"http:\/\/www.engadget.com\/2009\/10\/10\/t-mobile-we-probably-lost-all-your-sidekick-data\/\">Upto 1 million T-Mobile sidekick customers lose their mobile data<\/a>\r\n\r\n<a href=\"http:\/\/www.theregister.co.uk\/2009\/06\/08\/webhost_attack\/\">100,000 websites wiped by hack attack<\/a>","title":"Cloud Computers - An easy way to lose all your data","status":"publish","name":"cloud-computers-an-easy-way-to-lose-all-your-data","type":"","tags":["Cloud Computers","Amazon EC2","Microsoft Azure","Data Loss"],"categories":["General\/Techie"],"comments":[]}