{"date":"2009-04-15 06:36:44","content":"The first time I installed this USB skype adapter it worked great. Then after a few days it just refused to work with skype anymore and it's icon would stay a permanent red colour in the system tray instead of being green to show it's connected and ready to use. Here's everything I did to fix this and get it connecting again! By the way I'm running windows vista and not xp, although some of this may help you fix a problem in xp!\r\n\r\nFirstly I thought I'd try reinstalling the software but unfortunately when I clicked to uninstall the \"Zoom Phone Adapter\" in the \"Programs and Features\" list the computer just sat there and did nothing. I restarted and tried this in safe mode but experienced the same result.\r\n\r\nFortunately Microsoft have provided a great tool for cleaning up stubborn programs that won't uninstall. It's called the \"Windows Installer Clean Up Utility\" and it can be found here <a href=\"http:\/\/support.microsoft.com\/kb\/290301\">http:\/\/support.microsoft.com\/kb\/290301<\/a>. When installing this you need to install it as an administrator or you will receive a VB script run time error message. To install it as an administrator, right click on the installation file and click \"Run as administrator\".\r\n\r\nOnce the \"Windows Installer Clean Up Utility\" has been installed I found it didn't add a shortcut to the start menu. To program can be run from \"C:\\Program Files\\msicuu.exe\". The utility will show you a list of installed program, click the zoom adapter in the list and then click uninstall. Be sure to only uninstall the zoom adapter as this utility will completely remove the programs you select.\r\n\r\nOnce removed I restarted the computer and then downloaded the latest drivers for the phone adapter from <a href=\"http:\/\/www.zoom.com\/techsupport\/voip\/voip_skype_5900.shtml\">http:\/\/www.zoom.com\/techsupport\/voip\/voip_skype_5900.shtml<\/a>. Make sure skype is not running. When installing these I again run it as adminstrator. After the installation I shut down the computer, plugged in the USB zoom adapter, turned the computer on and a prompt came up to complete the installation. After completing the installation the Phone adapter has been working brilliantly.","title":"Fixing Problems with the Zoom Skype ATA Series 0380 Model 5900 USB Phone Adapter","status":"publish","name":"fixing-problems-with-the-zoom-skype-ata-series-0380-model-5900-usb-phone-adapter","type":"","tags":["Skype","VOIP","Zoom","Model 5900","USB"],"categories":["Guides\/Fixes","General\/Techie"],"comments":[{"author":"Brian","authorEmail":"bke1972@msn.com","authorURL":"","authorIP":"63.240.74.4","timestamp":"2009-12-09 17:36:24","timestampGMT":"2009-12-09 16:36:24","comment":"Craig,\r\n\r\nYour instructions worked great!","browser":"Mozilla\/4.0 (compatible; MSIE 8.0; Windows NT 5.1; Trident\/4.0; .NET CLR 1.1.4322; .NET CLR 2.0.50727; .NET CLR 3.0.04506.30; .NET CLR 3.0.4506.2152; .NET CLR 3.5.30729)"}]}