{"_id":{"$id":"51feb420560e7051629da7d9"},"date":"2010-01-21 07:00:26","content":"Fusion power should finally fulfill the promise of cheap and abundant electricity. Current worldwide energy supplies (stuff we haven't yet pulled out of the ground) are like so:\r\n\r\n    Oil: 43 years\r\n    Uranium: ~150 years\r\n    Gas: 167 years\r\n    Coal: 417 years\r\n\r\nThis is not great, coal fuel is the longest lasting but also the dirtiest fuel. It's also worth noting that these fossil fuels can be in very unstable countries. Only 1% of the worlds oil is located within Europe for instance. What we need is fusion, a completely different kind of power source.\r\n\r\nSo what does a fusion reactor need as fuel?\r\n\r\nYou need some Deuterium and some Tritium. Deuterium can be harvested from sea water and tritium is made from Lithium. When heated to 150 million degrees, the fusion of Deuterium and Tritium gives us Helium, a Neutron and loads of energy. That spare neutron can then be fused with Lithium to make more Tritium. So the main fuels are Deuterium and Lithium, with a little tritium to get the whole process started.\r\n\r\nWe have enough Lithium on Earth to support the entire human races energy needs for 30 million years.\r\n\r\nWhat progress have we made so far? <a href=\"http:\/\/en.wikipedia.org\/wiki\/Joint_European_Torus\">JET<\/a> has been running since 1983, <a href=\"http:\/\/en.wikipedia.org\/wiki\/ITER\">ITER<\/a> will be functional in 2018 and <a href=\"http:\/\/en.wikipedia.org\/wiki\/DEMO\">DEMO<\/a> will begin pumping energy into the grid some time in the 2030's.\r\n\r\nWhat can the average man do to make this technology happen faster?\r\n\r\nLearn more about and teach others about the merits of fusion technology. There is a common misconception that fusion will create hazardous waste like our current nuclear reactors. It will create some but there will be far less of it and it will become harmless within decades as opposed to the hundreds of years for current nuclear power stations. I can't stress enough that fusion reactors are completely different to the fission reactors that people are used to, in the way they work,  safety and the waste they would produce.\r\n\r\nFor an example of misinformation, here is a Greenpeace article on the matter that doesn't cite any sources <a href=\"http:\/\/www.greenpeace.org\/international\/press\/releases\/ITERprojectFrance\">http:\/\/www.greenpeace.org\/international\/press\/releases\/ITERprojectFrance<\/a>. They state \"Fusion energy - if it would ever operate - would create a serious waste problem, would emit large amounts of radioactive material and could be used to produce materials for nuclear weapons\". I usually have a lot of respect for Greenpeace and the good they do, but they really dropped the ball on this one.\r\n\r\nSources:\r\n<a href=\"http:\/\/blog.ted.com\/2009\/12\/fusion_is_energ.php?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+TEDBlog+%28TEDBlog%29&utm_content=Google+Reader\">Steven Cowley on TED.com<\/a>\r\n<a href=\"http:\/\/www.iter.org\/default.aspx\">ITER website<\/a>\r\n<a href=\"http:\/\/www.iter.org\/newsline\/Documents\/107_Who%20is%20afraid%20of%20ITER_v1_0.pdf\">ITER Presentation on Nuclear Waste<\/a>\r\n<a href=\"http:\/\/www.iter.org\/proj\/Pages\/ITERAndBeyond.aspx\">ITER and beyond<\/a>\r\n<a href=\"http:\/\/www.eia.doe.gov\/emeu\/international\/RecentPetroleumConsumptionBarrelsperDay.xls\">Fossil Fuels - Oil<\/a>\r\n<a href=\"http:\/\/www.eia.doe.gov\/pub\/international\/iealf\/table13.xls\">Fossil Fuels - Natural Gas<\/a>\r\n<a href=\"http:\/\/www.eia.doe.gov\/pub\/international\/iealf\/table14.xls\">Fossil Fuels - Coal<\/a>","title":"Fusion Power","status":"publish","name":"fusion-power","type":"","tags":["Fusion Power","Natural Resources","Fossil Fuels"],"categories":["General"],"comments":[{"author":"M. Simon","authorEmail":"msimon@xta.com","authorURL":"http:\/\/powerandcontrol.blogspot.com\/","authorIP":"98.213.122.46","timestamp":"2010-01-21 14:49:53","timestampGMT":"2010-01-21 13:49:53","comment":"The Polywell Fusion Reactor.\r\n\r\nLook up \"We will know in two years\".","browser":"Mozilla\/5.0 (Windows; U; Windows NT 5.1; en-US; rv:1.8.1.11pre) Gecko\/20071206 Firefox\/2.0.0.11 Navigator\/9.0.0.5"}]}