{"date":"2013-03-12 07:00:45","content":"Super Capacitors have been closing the gap with batteries over the last decade. Maxwell Institute currently dominates the <a href=\"http:\/\/en.wikipedia.org\/wiki\/Supercapacitor\">Wikipedia article for super capacitors<\/a> and has devices that store enough power to be a phone battery replacement. The problem is, the capacitors currently require 10x the volume.\r\n\r\nWith capacitors continuously improving, this got me thinking. What is the maximum power density that physics allows for super capacitors and what would this mean if we achieved it... Would power stealing suddenly become a problem? would the capacitors store enough power to be a weapon? Could electrical power be stored as an investment?\r\n\r\nThe answers to these 3 questions could all be yes, if power density is high enough.\r\n\r\nImagine going into work, happily sitting down at your desk, then police rush in, the manager points at a colleague and the police march him out of the office while taking a keen interest in his laptop. You later find out he was stealing power, to the tune of £8 per day for the last two years. He had retrofitted his laptop with a a futuristic supercapacitor which was hidden inside and charged quickly and silently, holding as much power as it could take from the plug socket at his desk. He only took it home some nights (when it's fully charged) and would then plug it into his home power system and be paid by his energy provider to put the power back into the grid as \"green energy\". His scheme worked well netting him about £5700 until either his employer or his power provider realized something was going on.\r\n\r\nPerhaps don't imagine this next one, but a capacitor will catch fire and explode if it is charged and shorted out. Hopefully future high energy ones will have some kind of built in safety to prevent them being shorted out and exploding. This could be particularly worrying if dogs can't sniff out supercapacitors - but hopefully x-ray machines at airports would spot them.\r\n\r\nFinally, if you can store energy in a concentrated and efficient way (and this doesn't just apply to super capacitors) then you could store it when it is cheap to do so and sell power when\/where it's in demand. This could be to move power between giant solar arrays around the equator to cities that need it or simply storing power during the day for use at night (or vice versa in the case of nuclear power).\r\n\r\nIn the paper \"<a href=\"http:\/\/pubs.acs.org\/doi\/abs\/10.1021\/nl102661q\">Graphene-Based Supercapacitor with an Ultrahigh Energy Density<\/a>\", a team have achieved power density's of 85 watt hours per kg at room temperature. This will hold about 1.02 pence of power, assuming electrical cost of 12 pence per kwh.\r\n\r\n(12 \/ 1000) * 85 = 1.02\r\n\r\nThis falls far short of being viable for any of my 3 scenerios. For instance, this power density would need to be improved by at least 3 orders of magnitude before power theft would be viable.\r\n\r\nA counter argument to the economics of stealing power is that super capacitors may cause a drop in the cost of power per kwh. This might be realized in having less power stations but enough power storage to keep up with times of peak demand (e.g. store the power that is effectively \"wasted\" at night by nuclear power stations that prefer to be on 24x7 rather than constantly being turned up and down).\r\n\r\nSupercapacitors could be a very disruptive technology, but they need to improve quickly enough to ensure other power storage methods don't beat it to mass production.","title":"Future of The Super Capacitor","status":"publish","name":"future-of-the-super-capacitor","type":"","tags":[],"categories":["Astrothoughts"],"comments":[]}