{"date":"2009-05-31 21:59:46","content":"This one is a bit of a heavy thought experiment I've been thinking about for some time now. I've used the <a href=\"http:\/\/en.wikipedia.org\/wiki\/Lorentz_factor\">Lorentz factor<\/a> to work out the time dilation difference in seconds for certain speeds. I first started out asking what effect time dilation has when we travel by airplane or if we live on the equator, but it quickly grew from there ...\r\n\r\n<strong>Time Dilation at the Earth's equator:<\/strong>\r\nLiving on the equator means that due to the Earths spin you get an additional 465.1 m\/s of velocity vs sitting on the pole (This does not take into account any wobble on the Earth's axis). Compared to anyone sitting at the poles you would be 0.00004 seconds younger for each year that passes. \r\n\r\nOver a 100 year life time: 4 milliseconds\r\n\r\n<strong>Passenger Aircraft:<\/strong>\r\nFlying in a plane can get you speeds of up to 917 m\/s when in one of the <a href=\"http:\/\/en.wikipedia.org\/wiki\/Boeing_747-400\">latest Boeing 747s<\/a>. Unfortunately that speed is not constant as it takes time to take off and get to the cruising speed. At 917 m\/s if you cruise for 10 hours, you would be 0.168 microseconds younger than if you stayed on the ground. If you somehow managed to get a plane to fly non stop (refuel in the air?) then over a 1 year period you would be 0.0001475 seconds younger compared to if you were left on the ground.\r\n\r\nOver a 100 year life time: 14.75 milliseconds\r\n\r\nIf we also take into account that you are flying east around the equator then we get 917 m\/s from the plane and 465.1 m\/s of velocity from the rotating Earth. At 1382.1 m\/s you would gain 0.000335133072 seconds vs you sitting at one of the poles.\r\n\r\nOver a 100 year life time: 33.51 milliseconds\r\n\r\n<strong>Live on The International Space Station:<\/strong>\r\nThe ISS orbits the earth at 7706.6 m\/s relative to the Earth's center. If you had the money (or some serious negotiating skills) and managed to live on board the ISS each year you would be 0.0104198349888 seconds younger than if you had stayed on the north pole.\r\n\r\nOver a 100 year life time: 1.04 seconds\r\n\r\n<strong>Live on Mercury:<\/strong>\r\nThe planet Mercury orbits the sun at a fast paced 47.87 km\/s. After subtracting Earth's velocity of 29.78km per second we have a speed difference of 18.09km per second. Although it would not be possible to live anywhere except on the poles due to high temperatures. At this speed you would be 0.057 seconds younger per year than if you stayed back on Earth.\r\n\r\nOver a 100 year life time: 5.74 seconds\r\n\r\nIf you were then able to get a satellite such as the ISS to be built around Mercury (obviously with some very effective heat\/radiation shielding) You could gain an additional 6km\/s in orbital speed giving you a total of 53.87km\/s and a difference of 24.09km per second compared to Earth.\r\n\r\nOver a 100 year life time: 10.18 seconds\r\n\r\n\r\nPlease see <a href=\"\/blog\/2009\/07\/harnessing-time-dilation-part-2\/\">Harnessing Time Dilation part 2<\/a> for improvements to this article and taking my thought experiment even further.\r\n\r\nWorkings, Assumptions, Limitations:\r\nSeconds in a year: 60*60*24*365 = 31536000\r\nSeconds in 100 years: 60*60*24*365*100 = 3153600000\r\nVelocity may be more complicated for objects orbiting planets. (Any input from someone in the field would be much appreciated)\r\n","title":"Harnessing Time Dilation","status":"publish","name":"harnessing-time-dilation","type":"","tags":["Time Dilation","Time Travel"],"categories":["Astrothoughts"],"comments":[{"author":"glenn","authorEmail":"glennessex@gmail.com","authorURL":"http:\/\/doubleshotexpresso.com","authorIP":"205.157.110.11","timestamp":"2009-07-01 15:42:18","timestampGMT":"2009-07-01 14:42:18","comment":"could you explain the math more specifically?","browser":"Mozilla\/4.0 (compatible; MSIE 6.0; Windows NT 5.1; SV1; .NET CLR 1.1.4322; .NET CLR 2.0.50727)"},{"author":"Joe Thomas","authorEmail":"thomasje@copper.net","authorURL":"","authorIP":"66.245.216.79","timestamp":"2009-07-01 16:17:40","timestampGMT":"2009-07-01 15:17:40","comment":"Velocity equals distance divided by time.\r\n\r\nThe Index of Refraction is the ratio of the speed of light in a vacuum vs the speed of light in some medium. If we assume \"C\" is a constant, and distance is a \"constant\" +\/- 1% Then the only remaining factor is Time. The index of refraction of flesh is substantial..so how old are your insides? :-)","browser":"Mozilla\/4.0 (compatible; MSIE 7.0; Windows NT 5.1; .NET CLR 2.0.50727)"},{"author":"Alex","authorEmail":"aklotz@gmail.com","authorURL":"","authorIP":"173.34.39.95","timestamp":"2009-07-01 16:38:45","timestampGMT":"2009-07-01 15:38:45","comment":"When you're dealing with space stations and other planets, you have to take into account gravitational time dilation as well, from general relativity. It has the opposite effect, and is stronger than the zoom zoom variety of time dilation.","browser":"Mozilla\/5.0 (Windows; U; Windows NT 5.1; en-US) AppleWebKit\/530.5 (KHTML, like Gecko) Chrome\/2.0.172.33 Safari\/530.5"}]}