{"_id":{"$id":"51feb420560e7051629da5dc"},"date":"2009-07-19 14:39:57","content":"This follows on from my first article about harnessing time dilation. If you haven't read my first article then I highly recommend you do before reading this one. I've included a spreadsheet so you can do these calculations yourself (available <a href=\"\/uploads\/2009\/07\/Time-Dilation.xls\">here<\/a>). I've also improved the calculations accuracy and taken into account that there are not exactly 365 days in a year but instead 365.24219 days in a year. So this means the difference in seconds is slightly higher (more time!).\r\n\r\n<img src=\"\/uploads\/2009\/07\/8e8943fcbf5e131710d8d04571f428e51.png\" alt=\"Time Dilation Formula\" title=\"Time Dilation Formula\" width=\"213\" height=\"57\" class=\"size-full wp-image-255\" \/>\r\n\r\n<strong>Time Dilation at the Earth's equator:<\/strong>\r\nLiving on the equator means that due to the Earths spin you get an additional 465.1 m\/s of velocity vs sitting on the pole (This does not take into account any wobble on the Earth's axis). Compared to anyone sitting at the poles you would be 0.000038 seconds younger for each year that passes. \r\n\r\nOver a 100 year life time: 3.8 milliseconds\r\n\r\n<strong>Passenger Aircraft:<\/strong>\r\nFlying in a plane can get you speeds of up to 917 m\/s when in one of the <a href=\"http:\/\/en.wikipedia.org\/wiki\/Boeing_747-400\">latest Boeing 747s<\/a>. Unfortunately that speed is not constant as it takes time to take off and get to the cruising speed. At 917 m\/s if you cruise for 10 hours, you would be 0.168 microseconds younger than if you stayed on the ground. If you somehow managed to get a plane to fly non stop (refuel in the air?) then over a 1 year period you would be 0.0001476 seconds younger compared to if you were left on the ground.\r\n\r\nOver a 100 year life time: 14.76 milliseconds\r\n\r\nIf we also take into account that you are flying east around the equator then we get 917 m\/s from the plane and 465.1 m\/s of velocity from the rotating Earth. At 1382.1 m\/s you would gain 0.000335133072 seconds vs you sitting at one of the poles.\r\n\r\nOver a 100 year life time: 33.54 milliseconds\r\n\r\n<strong>Live on The International Space Station:<\/strong>\r\nThe <a href=\"http:\/\/en.wikipedia.org\/wiki\/Iss\">ISS<\/a> orbits the earth at 7706.6 m\/s relative to the Earth's center. If you had the money (or some serious negotiating skills) and managed to live on board the ISS each year you would be 0.0104198349888 seconds younger than if you had stayed on the north pole.\r\n\r\nOver a 100 year life time: 1.043 seconds\r\n\r\n<strong>Live on Mercury:<\/strong>\r\nThe planet Mercury orbits the sun at a fast paced 47.87 km\/s. Although it would not be possible to live anywhere except on the poles due to high temperatures. Taking into account that the Earth is orbiting the Sun at 29.78km\/s. At this speed (18.09 km\/s) you would be 0.057 seconds younger per year than if you stayed back on Earth.\r\n\r\nOver a 100 year life time: 5.75 seconds\r\n\r\nIf you were then able to get a satellite such as the <a href=\"http:\/\/en.wikipedia.org\/wiki\/Iss\">ISS<\/a> to be built around Mercury (obviously with some very effective heat\/radiation shielding) You could gain an additional 6km\/s in orbital speed giving you a difference of 24.09km\/s compare to Earth.\r\n\r\nOver a 100 year life time: 10.19 seconds\r\n\r\n<strong>Hypothetical Limit to Orbital Velocity:<\/strong>\r\nTo hypothetically test the limitations of time dilation for an object in orbit around the sun we could create an artificial satellite with advanced heat shielding to allow us to get closer than mercury. We are limited by the fact that anything closer than 9 million km to the sun would not be in a stable orbit and would fall into the sun. We are also limited by the temperature being in excess of 1000 kelvin at 14 million km from the sun. So let's go for 15 million km (0.1 <a href=\"http:\/\/en.wikipedia.org\/wiki\/Astronomical_unit\">AU<\/a>) and hope our heat shielding holds out! At this distance we will get an orbital velocity of 91.96 km\/s. With a difference of 62.18 km\/s from Earth.\r\n\r\nOver a 100 year life time: 67.88 seconds\r\n\r\n\r\nWorkings, Assumptions, Limitations:\r\nSeconds in a year: 31556926 (taking into account leap years, seconds)\r\nSpeed of Light: 299792458 m\/s\r\nVelocity may be more complicated for objects orbiting planets. (Any input from someone in the field would be much appreciated)","title":"Harnessing Time Dilation part 2","status":"publish","name":"harnessing-time-dilation-part-2","type":"","tags":["Time Dilation","Time Travel"],"categories":["Astrothoughts"],"comments":[{"author":"Craig Mayhew","authorEmail":"craig@mayhew.io","authorURL":"","authorIP":"82.19.116.237","timestamp":"2013-05-13 20:24:03","timestampGMT":"2013-05-13 19:24:03","comment":"A star in our galaxy moving at 2% speed of light: http:\/\/en.wikipedia.org\/wiki\/S2_(star)","browser":"Mozilla\/5.0 (Windows NT 6.1; WOW64) AppleWebKit\/537.31 (KHTML, like Gecko) Chrome\/26.0.1410.64 Safari\/537.31"}]}