{"_id":{"$id":"51feb422560e7051629daafc"},"date":"2012-05-28 09:00:14","content":"I am a keen believer in law. It stops me being killed for my wallet while walking to the shop, keeps my house from being broken into while walking to said shop and my family safe.\r\n\r\nSo when a new law is passed - I do my best to comply. This one however, is ridiculous.\r\n\r\n<b>The EU Cookie law.<\/b>\r\n\r\nA law passed by the european union as a european directive. A directive to protect online users from cookies. The same cookies that make the web as we know it actually work.\r\n\r\nSo to get my site to adhere to the european law (which is slightly different depending on the EU country so I assume as I am not a solicitor and to be on the safe side that I need to abide by all variations). All I need to do is get informed consent from my website visitors before placing any cookies on their machine. It is important to note at this point that it's not just cookies from craigmayhew.com but also any cookies from third party services I use on my site (facebook buttons, twitter buttons, google analytics, google adsense... the list goes on).\r\n\r\nSo, all I need to do is prevent any anonymous google analytics data from being recorded, adverts displayed and twitter\/facebook buttons from appearing until I have \"implied consent\" from the website user.\r\n\r\nI could achieve complied consent by displaying a banner at the top (welcome back to the 90's!) asking the user to consent to cookies, deny cookies or continue anyway which would default to allowing cookies. Assuming they consent or continue then I can record anonymous google analytics data, display adverts and use twitter\/facebook buttons, but only on the second page view.\r\n\r\nGreat - except 90% of my visitors only visit one page on my site. They find the exact page they need via Google, read the page, get the info and get out. So now I can't get advertising revenue from 90% of users?\r\n\r\nOh wait I could display a dialog to every first time visitor before content is loaded demanding they accept my cookies or leave. Yea that would keep the site profitable.\r\n\r\nThanks EU directive, good one.\r\n\r\nIn response I have removed all advertising, analytics and all share buttons. So on the upside you as the site user have slightly faster page loads, but with reduced functionality. The silver lining for me is that the site no longer makes any money and so I no longer have to worry about paying tax for it :)","title":"How I complied with the EU Cookie Law","status":"publish","name":"how-i-complied-with-the-eu-cookie-law","type":"","tags":["EU","Cookies"],"categories":["General"],"comments":[{"author":"Beth","authorEmail":"me@Bethaney.co.uk","authorURL":"http:\/\/Bethaney.co.uk","authorIP":"82.10.181.29","timestamp":"2012-05-28 10:30:19","timestampGMT":"2012-05-28 09:30:19","comment":"I loved this article and would love to share it on Facebook but as there is no handy button I can't. Be bothered that is.\r\n\r\nOh well.","browser":"Mozilla\/5.0 (Linux; Android 4.0.3;  Transformer Prime TF201 Build\/IML74K) AppleWebKit\/535.19 (KHTML, like Gecko) Chrome\/18.0.1025.133  Safari\/535.19"},{"author":"Hughster","authorEmail":"hughster@hughster.co.uk","authorURL":"http:\/\/www.hughster.co.uk\/","authorIP":"86.0.21.34","timestamp":"2012-06-11 12:09:34","timestampGMT":"2012-06-11 11:09:34","comment":"The law says:\r\n\r\n\"A person shall not store or gain information, or to gain access to information stored, in the terminal equipment of a subscriber or user unless ... the subscriber or user ... is provided with clear and comprehensive information about the purposes of the storage of, or access to, that information; and ... has given his or her consent\".\r\n\r\nAnd also:\r\n\r\n\"For the purposes of [the paragraph above], consent may be signified by a subscriber who amends or sets controls on the internet browser which the subscriber uses or by using another application or programme to signify consent.\"\r\n\r\nSo, provide a privacy policy that describes the purposes of the cookies your site uses and inform the user that their consent is signified by setting their browser cookie settings to allow them.","browser":"Mozilla\/5.0 (Windows NT 6.1; WOW64) AppleWebKit\/536.5 (KHTML, like Gecko) Chrome\/19.0.1084.52 Safari\/536.5"}]}