{"_id":{"$id":"51feb420560e7051629da720"},"date":"2009-11-14 11:54:57","content":"This article details how to download and compile the latest bleeding edge build of Firefox on Microsoft Windows 7. The firefox build will be full of bugs because it is bleeding edge, so don't use this for anything important :) On the upside you will get to play with new features long before anyone that waits for \"stable\" versions to be released. Here we go:\r\n\r\nInstall <a href=\"http:\/\/ftp.mozilla.org\/pub\/mozilla.org\/mozilla\/libraries\/win32\/MozillaBuildSetup-Latest.exe\">MozillaBuild<\/a>, a package of additional build tools. Make sure you install this with a directory path that does not contain any spaces (e.g. c:\\mozilla-build\\). If you get a message saying this application did not install properly then you should see a windows dialog giving you the option to re-install with the 'correct settings'. After that all should be well.\r\n\r\nIf you don't already have Visual C++ 2008 then download and install the express edition from <a href=\"http:\/\/www.microsoft.com\/Express\/vc\/\">http:\/\/www.microsoft.com\/Express\/vc\/<\/a>\r\n\r\nDownload the windows SDK if you don't already have it installed (If unsure install it anyway) from here: <a href=\"http:\/\/www.microsoft.com\/downloads\/thankyou.aspx?familyId=c17ba869-9671-4330-a63e-1fd44e0e2505&displayLang=en\">http:\/\/www.microsoft.com\/downloads\/thankyou.aspx?familyId=c17ba869-9671-4330-a63e-1fd44e0e2505&displayLang=en<\/a>\r\n\r\nWe need to make sure that windows is using the SDK that we have just installed. Find \"Windows SDK Configuration Tool\" on your start menu, run it. Select \"v7.0\" (or higher) in the drop down box and click \"make current\".\r\n\r\nNow we need to create your mozconfig file. This will contain various compile options for your custom build of firefox. Substituting {username} for your real username, you should find your mozconfig file here: C:\\Users\\{username}\\mozilla-central\\mozconfig\r\n\r\nI recommend that unless you know what your doing or run into compile issues that are specific to your system then edit your mozconfig file to look like this:\r\n<pre style=\"border: 1px solid #FFFFFF; padding: 5px; overflow:auto;\">\r\n. $topsrcdir\/browser\/config\/mozconfig\r\nmk_add_options MOZ_OBJDIR=@TOPSRCDIR@\/objdir-ff-release\r\nmk_add_options MOZ_MAKE_FLAGS=\"-j4\"\r\n\r\n#adding this to prevent it erroring about not being able to build for version 601000\r\nmk_add_options MOZ_WINSDK_TARGETVER=600\r\n\r\n#stop the atl errors\r\nac_add_options --disable-xpconnect-idispatch\r\nac_add_options --disable-activex\r\nac_add_options --disable-activex-scripting\r\nac_add_options --disable-accessibility\r\n<\/pre>\r\n\r\nHurrah, that's all of the setup out of the way. Now we can try and compile firefox! Open a shell window by running: c:\\mozilla-build\\start-msvc9.bat. Even if you're on 64-bit Windows, do not use the files ending in -x64.bat.\r\n\r\nIn the newly opened shell window type the following:\r\nTo get the latest source:\r\n<pre style=\"border: 1px solid #FFFFFF; padding: 5px; overflow:auto;\">\r\nhg clone http:\/\/hg.mozilla.org\/mozilla-central\/\r\n<\/pre>\r\nTo navigate to the mozilla-central directory:\r\n<pre style=\"border: 1px solid #FFFFFF; padding: 5px; overflow:auto;\">\r\ncd mozilla-central\r\n<\/pre>\r\nTo start the build process:\r\n<pre style=\"border: 1px solid #FFFFFF; padding: 5px; overflow:auto;\">\r\nmake -f client.mk\r\n<\/pre>\r\n\r\nOnce compiled (It may take hours depending on your system) the firefox executable can be found in C:\\Users\\{username}\\mozilla-central\\objdir-ff-release\\dist\\bin\r\n\r\nI recommend you create a shortcut to the executable and don't open it directly. This way you can have it run from a different firefox profile and have it running at the same time as your standard firefox build while keeping the two completely seperate. This will prevent the addons etc from erroring about the unsupported firefox version. The short cut should be formatted as such: \"Firefox.exe\" -p \"{PROFILE}\" -no-remote (note: substitute the name of your profile for {PROFILE} or omit to launch the profile manger instead). I've set mine to \"Firefox.exe\" -p \"nightly\" -no-remote\r\n\r\nIf your still unable to compile firefox then please leave a comment, then try other resources such as <a href=\"https:\/\/developer.mozilla.org\/En\/Simple_Firefox_build\">https:\/\/developer.mozilla.org\/En\/Simple_Firefox_build<\/a>.","title":"Compiling and Installing Nightly Builds of Firefox on Windows 7","status":"publish","name":"installing-nightly-builds-of-firefox-on-windows-7","type":"","tags":["Firefox","Windows 7","Compile","MozillaBuild","mozconfig"],"categories":["Guides\/Fixes"],"comments":[{"author":"max","authorEmail":"maxdeliso@gmail.com","authorURL":"","authorIP":"71.58.78.222","timestamp":"2011-07-23 13:33:33","timestampGMT":"2011-07-23 12:33:33","comment":"apparently on windows it's a bad idea to use the -j4 make flags, your build might fail.\r\n\r\nif you want a parallel build you should instead use pymake\r\n\r\n(this is according to MDN)\r\n\r\nnice tutorial,\r\ncheers","browser":"Mozilla\/5.0 (Windows NT 6.1; WOW64) AppleWebKit\/534.30 (KHTML, like Gecko) Chrome\/12.0.742.122 Safari\/534.30"}]}