{"date":"2012-03-05 13:17:28","content":"Recently upgraded one of my machines (all changed except the power supply, some drives and the case).\r\n\r\nI've gone for the 2011 socket motherbaord P9-X79PRO due to it allowing for 8 DDR3 RAM slots and this incredible bargain processor, the Core I7-3820.\r\n\r\nOne problem I found with this board was the lack of room for a heat sink which meant some modifications to my Thermaltake Frio so it didn't block two of the RAM slots - not to mention the incredibly picky BIOS it comes with.\r\n\r\nBut anyway some usage case benchmarks in 7zip:\r\n<img class=\"alignleft size-full wp-image-1632\" title=\"Core I7-3820 - 7z benchmark\" src=\"\/uploads\/2012\/03\/Core-I7-3820-7z-benchmark.png\" alt=\"Core I7-3820 - 7z benchmark\" width=\"569\" height=\"339\" \/> At this point it setttled down to 6.9MB\/s but averaged 8MB\/s. This is with just about every setting maxed out for ultra compression and using 8 threads over all 4 cores of the processor. When it completed it ran at about 25GBs of data compression per hour. The majority of the time the processor had switched itself to turbo mode and was running at about 3.9Ghz. Also it may have got slightly more speed if I wasn't simultaniously running 3 virtual machines and writing this blog post.\r\n\r\n\r\n\r\n\r\n\r\n<img src=\"\/uploads\/2012\/03\/Core-I7-3820-7z-setup.png\" alt=\"Core I7-3820 - 7z setup\" title=\"Core I7-3820 - 7z setup\" width=\"317\" height=\"307\" class=\"alignleft size-full wp-image-1637\" \/> Here is the setup so you can view all the options I had - I was still RAM bound but I was compressing a 33GB directory! I've decided 32GBs isn't enough and that I need more RAM :)\r\n\r\nFurther testing with a server backup shows the compression is improved by upto 20% due to using 32GBs of RAM and the tweaked settings rather than just 4GBs as I was before. So I'm currently recompressing all my old backups - which should save me around 600GBs of disk space.\r\n\r\n\r\n","title":"Intel 3.6Ghz Core I7-3820 with 32GBs of RAM and 7zip","status":"publish","name":"intel-3-6ghz-core-i7-3820-with-32gbs-of-ram-and-7zip","type":"","tags":["7zip","Core I7-3820","32GB RAM","Benchamrk"],"categories":["General\/Techie"],"comments":[]}