{"date":"2011-01-17 08:00:23","content":"<a href=\"\/uploads\/2011\/01\/I_robot_car.jpg\"><img src=\"\/uploads\/2011\/01\/I_robot_car-300x225.jpg\" alt=\"Audi I robot car\" title=\"Audi I robot car\" width=\"300\" height=\"225\" class=\"alignright size-medium\" \/><\/a>I love thinking up hypothetical sceneios loosely or seriously based on reality, this particular one is about the steady automation of the jobs market and how this will effect those that drive for a living.\r\n\r\n<strong>Automation<\/strong>\r\n\r\nTaxi drivers could be facing automation in the not too distant future. With the <a href=\"http:\/\/www.youtube.com\/watch?v=VAiH1LX8guk \">latest driving automation technology<\/a> your job may be gone sooner than you think. The holy grail of people facing a daily commute by road is a fully autonamous car to drive them there. This would suddenly free up your commute time in the same way train travellers can read or sleep while commuting. Once this hits the mass market, owners of taxi companies will likely trial automated taxis and after finding that they reduce their costs and therefore can offer cheaper fares, they will switch their entire taxi force. And of course automated taxis can run 24 hours a day too. I'm sure that each car manufacturer will provide a permenant internet connection for the car so that it can communicate with other cars and avoid traffic problems that have been detected ahead.\r\n\r\nLorry drivers would face the same problem, lorrys that can go 24 hours a day and not be forced to stick to working hour limits by the EU would be very tempting.\r\n\r\nTrain drivers, have already been reminded by <a href=\"http:\/\/www.bbc.co.uk\/news\/uk-england-london-12189442\">Borris Johnson<\/a> that their jobs are being automated and possibly more so now in response to the <a href=\"http:\/\/www.bbc.co.uk\/news\/uk-england-london-11855731\">recent London Tube strikes<\/a>.\r\n\r\nPilots may actually be safe for the time being as the pilot is not a very expensive part of the whole process. Fuel costs and landing fees are a much bigger concern. Also the number of automated planes would be much much lower than the number of automated cars, which might slow the pace to mass production.\r\n\r\n<strong>New job creation<\/strong>\r\n\r\nNew jobs might be created - but these will be skilled jobs - which you can't easily jump into without knowledge and experience. Fixing and repairing an automated taxi is likely going to be something that can be done after training - but not something a taxi driver could just walk into. So although new jobs will be created - unless you have looked ahead and trained in repairing and maintaining automated taxis while in full time employment as a taxi driver your going to be stuck with menial and low pay work.\r\n\r\n<strong>The people push back<\/strong>\r\n\r\nIn the same way that groups attacked and destroyed many of Britain's speed cameras, so might it happen again to autmoated technologies. When change is sudden and unexpected people get scared. As a knee jerk reaction we might get anti automation groups forming - and people boycotting companies that use automation. We will eventually have some kind of equilbrium and some of the manual jobs are maintained by those that refuse to use the new automated work force.\r\n\r\nCredits:\r\nI robot car by Eirik Newth, original available here: <a href=\"http:\/\/www.flickr.com\/photos\/29904699@N00\/6995583\">http:\/\/www.flickr.com\/photos\/29904699@N00\/6995583<\/a>","title":"Job automation - drivers beware","status":"publish","name":"job-automation-drivers-beware","type":"","tags":["Singularity","Borris Johnson","Automation"],"categories":["Astrothoughts"],"comments":[{"author":"Craig Mayhew","authorEmail":"craig@mayhew.io","authorURL":"","authorIP":"93.97.160.59","timestamp":"2011-01-19 00:40:01","timestampGMT":"2011-01-18 23:40:01","comment":"The metro has an article on car trains which will probably be here before the fully autonomous cars.\r\n\r\nhttp:\/\/www.metro.co.uk\/news\/853046-a-driverless-car-is-on-the-road-ahead","browser":"Mozilla\/5.0 (X11; U; Linux i686; en-US) AppleWebKit\/534.10 (KHTML, like Gecko) Ubuntu\/10.04 Chromium\/8.0.552.224 Chrome\/8.0.552.224 Safari\/534.10"},{"author":"Craig Mayhew","authorEmail":"craig@mayhew.io","authorURL":"","authorIP":"82.10.181.29","timestamp":"2012-05-14 08:54:14","timestampGMT":"2012-05-14 07:54:14","comment":"US state of Nevada has legalized fully automated cars:\r\n\r\nhttp:\/\/www.bbc.co.uk\/news\/technology-17989553","browser":"Mozilla\/5.0 (Windows NT 6.1; WOW64) AppleWebKit\/535.19 (KHTML, like Gecko) Chrome\/18.0.1025.162 Safari\/535.19"}]}