{"date":"2009-03-03 00:35:08","content":"At the PHPUK conference I had the all too brief pleasure of playing with a Microsoft Surface. An application was shown that had virtual balls bouncing around the screen, anything you placed on the table instantly became a physical barriar to the balls and they would bounce of the edge of business cards, paper, poker chips, coins and anything else that was placed on the table.\r\n\r\nThe table responded just as you'd expect to chucking photos around and  resizing, rotating them but I really can't see the appeal. I'd much rather look at a very high resolution screen or picture frame when displaying photos rather than look down at a lower resolution table (only 1024x768 pixels!). For games however, If they can bring the price down on these to below £1000 then these could easily compete with or replace board games and group\/party orientated consoles like the Nintendo Wii.\r\n\r\nHere's a photo of the surface in action (In use by the two people who were standing next to me).\r\n<p style=\"text-align: center;\"><a href=\"\/uploads\/2009\/03\/dsc00107.jpg\"><img class=\"alignnone size-large wp-image-76\" title=\"Microsft Surface\" src=\"\/uploads\/2009\/03\/dsc00107-300x225.jpg\" alt=\"The Microsoft surface in action\" width=\"300\" height=\"225\" \/><\/a><\/p>\r\nUnfortunately the frame rate then dropped and the movements got a little jerky until finally the application crashed!\r\n<p style=\"text-align: center;\"><a href=\"\/uploads\/2009\/03\/dsc00106.jpg\"><img class=\"alignnone size-thumbnail wp-image-75\" title=\"Microsoft Surface - Crashing\" src=\"\/uploads\/2009\/03\/dsc00106-150x150.jpg\" alt=\"Microsoft Surface Crashing\" width=\"150\" height=\"150\" \/><\/a><a href=\"\/uploads\/2009\/03\/dsc00105.jpg\"> <img class=\"alignnone size-thumbnail wp-image-74\" title=\"The Microsoft Surface - Crashing\" src=\"\/uploads\/2009\/03\/dsc00105-150x150.jpg\" alt=\"The Microsoft surface crashing\" width=\"150\" height=\"150\" \/><\/a><a href=\"\/uploads\/2009\/03\/dsc00106.jpg\"> <\/a><\/p>\r\nBack to the positives though, this table will be really good when it's cheaper and I can't wait to see the applications people develope for it.","title":"Microsoft Surface - First Impressions","status":"publish","name":"microsoft-surface-first-impressions","type":"","tags":["Microsoft Surface"],"categories":["Reviews\/Experience"],"comments":[]}