{"_id":{"$id":"51feb422560e7051629dab41"},"date":"2012-11-26 09:36:42","content":"I'm now running:\r\n\r\n<strong>Virtualized Windows 7 64bit<\/strong>\r\nI now work from a virtual machine. It is one of many workstations and servers now running on a single chunk of hardware. All main drives are 256GB ssds (VMs are selectively spread across these), 3TB spinning drive for backups, 32GBs of RAM, quad core i7-3820 CPU and a cheap \/ efficient GeForce GTX550 Ti. Not currently using any RAID, just regular backups (Really should RAID my backup drive).\r\n\r\n<strong>7-Zip<\/strong>\r\nThis creates very very compressed 7z archives and now supports a multitude of other archive types too. The more RAM you have, the better it will compress larger volumes of data. If you have loads of RAM then for best compression, use in 7z mode with ultra LMZA2, max dictionary and word size.\r\n<a href=\"http:\/\/www.7-zip.org\/download.html\">http:\/\/www.7-zip.org\/download.html<\/a>\r\n\r\n<strong>AVG<\/strong>\r\nThis has been updated to the latest paid version. Still impressed and still virus free.\r\n\r\n<strong>E Text Editor<\/strong>\r\nNot really using this as much as I should. Regex support is very nice in this.\r\n\r\n<strong>Grepwin<\/strong>\r\nWhere would I be without this awesome search tool? Lost, that's where.\r\n\r\n<strong>Mozilla Thunderbird<\/strong>\r\nStill the best free and open source email client in my opinion.\r\n<a href=\"http:\/\/www.mozilla.com\/en-US\/thunderbird\/\">http:\/\/www.mozilla.com\/en-US\/thunderbird<\/a>\r\n\r\n<strong>Netbeans IDE 7.2<\/strong>\r\nThis is still catching up with some of the other IDEs (e.g. NuSphere) but it's open source and supports XDebug so I'm happy.\r\n\r\n<strong>Skype<\/strong>\r\nAside from it's recent major security issue involving account takeover with their dodgy password reset page, it is still arguably the best free instant messenger, audio\/video conferencing software. <a href=\"http:\/\/www.skype.com\/download\/\">http:\/\/www.skype.com\/download<\/a>\r\n\r\n<strong>Titanium Studio 2.1.2<\/strong>\r\nThis was insanely complex to install. So many bugs in the install process or failed updates that I'm surprised anyone uses this. However, once installed I think very good for developing cross platform mobile apps.\r\n\r\n<strong>UltraVNC<\/strong>\r\nlThis can display the screen of another computer (via internet or network) on your own screen. This allows you to use your mouse and keyboard to control the other PC remotely. It means that you can work on a remote computer, as if you were sitting in front of it.\r\n<a href=\"http:\/\/www.uvnc.com\/download\/\">http:\/\/www.uvnc.com\/download<\/a>\r\n\r\n<strong>VideoLAN<\/strong>\r\nVLC media player is a highly portable multimedia player for various audio and video formats.\r\n<a href=\"http:\/\/www.videolan.org\/vlc\/\">http:\/\/www.videolan.org\/vlc<\/a>\r\n\r\n<strong>WinMerge<\/strong>\r\nUseful for comparing two or more text based files and highlighting the differences.\r\n<a href=\"http:\/\/winmerge.org\/downloads\/\">http:\/\/winmerge.org\/downloads<\/a>\r\n\r\n<b>So what's gone from my previous list in 2008?<\/b>\r\n\r\n<strong>Windows Messenger<\/strong>\r\nNo one is on here anymore and Microsoft are about to completely drop support for this.\r\n\r\n<strong>CutePDF Writer<\/strong>\r\nThis has been replaced by bullzip for me.\r\n\r\n<strong>Firefox<\/strong>\r\nWe have moved on from version 3 back in 2008 (to version 16!). Chrome however has slowly won me over due to it's speed and multi threading.\r\n\r\n<strong>Opera<\/strong>\r\nI never quite \"got\" opera.\r\n\r\n<strong>WinRAR<\/strong>\r\nIt cost money, isn't open source and is worse than 7zip on so many levels. It had to go.\r\n\r\n<strong>MWsnap<\/strong>\r\nWindows 7 has a snipping tool that seems far quicker to use. I've pinned it to the start bar and it's quick.\r\n\r\n<strong>Open Office<\/strong>\r\nI ended up buying Microsoft Office 2010. Open office really doesn't come close to how good office 2010 is.\r\n\r\n<strong>Folding@home<\/strong>\r\nWoah, when did I drop this from my machine? Probably the same time I started using world community grid. To be perfectly honest I'm now not too fussed about either. I would still like to heat my house from computers that are running charitable simulations, maybe next year?\r\n\r\n<strong>Synergy<\/strong>\r\nGone and haven't looked back.","title":"My Workstation Software","status":"publish","name":"my-workstation-software-2","type":"","tags":[],"categories":["General\/Techie"],"comments":[]}