{"_id":{"$id":"51feb421560e7051629da94b"},"date":"2010-08-11 21:21:30","content":"I have a keen interest in virtual worlds, they can allow you to design anything you want providing you have the time and the knowledge. This is what originally pulled me towards second life. Unfortunately when I started to use second life I didn't really understand how second life was used or how I could go about creating my items, objects, content etc. The learning curve was fairly long. I now understand how to do many of these things and intend to share it as much as possible with all of you (in a future blog post).\r\n\r\nLearn by example and all that so let's look at what second life is used for by looking at locations near my virtual house.\r\n\r\nSecond life is about communication, education and expression. It's about designing things for others to use or for you to use with others. It' about collaboration and meeting like minded people. Within 2 minutes of my house in second life I found the following places:\r\n<div id=\"_mcePaste\" style=\"position: absolute; left: -10000px; top: 0px; width: 1px; height: 1px; overflow-x: hidden; overflow-y: hidden;\">Places of Interest:<\/div>\r\n<div id=\"_mcePaste\" style=\"position: absolute; left: -10000px; top: 0px; width: 1px; height: 1px; overflow-x: hidden; overflow-y: hidden;\">House of the wolf <a href=\"http:\/\/maps.secondlife.com\/secondlife\/Orions%20Vale\/244\/221\/98\">http:\/\/maps.secondlife.com\/secondlife\/Orions%20Vale\/244\/221\/98<\/a><\/div>\r\n<div id=\"_mcePaste\" style=\"position: absolute; left: -10000px; top: 0px; width: 1px; height: 1px; overflow-x: hidden; overflow-y: hidden;\">, this place is huge and not short on detail. There is a huge spiral staircase leading to up the othe towers etc<\/div>\r\n<div id=\"_mcePaste\" style=\"position: absolute; left: -10000px; top: 0px; width: 1px; height: 1px; overflow-x: hidden; overflow-y: hidden;\">Someone built a whole race track complete with mot pit stop... Circuit la Corse <a href=\"http:\/\/maps.secondlife.com\/secondlife\/Valis\/67\/6\/122\">http:\/\/maps.secondlife.com\/secondlife\/Valis\/67\/6\/122<\/a> .. ok this part of a linden labs project http:\/\/blog.secondlife.com\/2008\/02\/08\/the-linden-department-of-public-works\/<\/div>\r\n<div id=\"_mcePaste\" style=\"position: absolute; left: -10000px; top: 0px; width: 1px; height: 1px; overflow-x: hidden; overflow-y: hidden;\">1930's Tokyo <a href=\"http:\/\/maps.secondlife.com\/secondlife\/Mordreds%20Crossing\/121\/7\/161\">http:\/\/maps.secondlife.com\/secondlife\/Mordreds%20Crossing\/121\/7\/161<\/a> is a fairly massive scripted town. Cars and trams have various scripted routes throught out the town and it's a very good simulation. This must consist of 100's of buildings many of which you can enter. group is \"Swing Era Japan\".<\/div>\r\n<div id=\"_mcePaste\" style=\"position: absolute; left: -10000px; top: 0px; width: 1px; height: 1px; overflow-x: hidden; overflow-y: hidden;\">So in short, second life is about finding like minded people and communicating.<\/div>\r\n<div id=\"_mcePaste\" style=\"position: absolute; left: -10000px; top: 0px; width: 1px; height: 1px; overflow-x: hidden; overflow-y: hidden;\">Ironically if you don't like people, you won't like second life.<\/div>\r\n<div id=\"_mcePaste\" style=\"position: absolute; left: -10000px; top: 0px; width: 1px; height: 1px; overflow-x: hidden; overflow-y: hidden;\">If you like exploring, your onto a winner. As usual the problem is finding the diamonds in the rough, as there is an unimaginable ammount of content is second life and most of it is rubbish.<\/div>\r\n\r\n<table>\r\n<tr><td>\r\n<a href='\/uploads\/2010\/08\/House-of-the-Wolf.png' title='House of The Wolf'><img align=\"left\" width=\"150\" height=\"150\" src=\"\/uploads\/2010\/08\/House-of-the-Wolf-150x150.png\" class=\"attachment-thumbnail\" alt=\"\" title=\"P1030931\" style=\"padding-right: 10px;\" \/><\/a>House of the wolf<br \/><a href=\"http:\/\/maps.secondlife.com\/secondlife\/Orions%20Vale\/244\/221\/98\">http:\/\/maps.secondlife.com\/secondlife\/Orions%20Vale\/244\/221\/98<\/a>\r\n\r\nThis is a huge cathedral, it's not short on detail with spiraling staircases, vast pillars and tall towers. I'm not sure it was built with a particular purpose, but it's fun to explore. Hide and seek maybe?<br \/><br \/>\r\n<\/td><\/tr>\r\n<tr><td>&nbsp;<\/td><\/tr>\r\n<tr><td>\r\n<a href='\/uploads\/2010\/08\/Circuit-la-Corse.png' title='House of The Wolf'><img align=\"left\" width=\"150\" height=\"150\" src=\"\/uploads\/2010\/08\/Circuit-la-Corse-150x150.png\" class=\"attachment-thumbnail\" alt=\"\" title=\"Circuit La Corse\" style=\"padding-right: 10px;\" \/><\/a>Circuit la Corse<br \/><a href=\"http:\/\/maps.secondlife.com\/secondlife\/Valis\/67\/6\/122\">http:\/\/maps.secondlife.com\/secondlife\/Valis\/67\/6\/122<\/a>\r\n\r\nThis is very long race track for people that love driving in second life. It's built by the Linden Department of Public Works http:\/\/blog.secondlife.com\/2008\/02\/08\/the-linden-department-of-public-works\/ who are working to make second life a better place (More on this later).<br \/><br \/>\r\n<\/td><\/tr>\r\n<tr><td>&nbsp;<\/td><\/tr>\r\n<tr><td>\r\n<a href='\/uploads\/2010\/08\/1930s-Tokyo.png' title='House of The Wolf'><img align=\"left\" width=\"150\" height=\"150\" src=\"\/uploads\/2010\/08\/1930s-Tokyo-150x150.png\" class=\"attachment-thumbnail\" alt=\"\" title=\"1930s Tokyo\" style=\"padding-right: 10px;\" \/><\/a>1930's Tokyo<br \/><a href=\"http:\/\/maps.secondlife.com\/secondlife\/Mordreds%20Crossing\/121\/7\/161\">http:\/\/maps.secondlife.com\/secondlife\/Mordreds%20Crossing\/121\/7\/161<\/a>\r\n\r\nThis is a simulation of a section of 1930's era Tokyo. Cars and trams are driving around their scripted routes. The area must consist of 100's of buildings many of which you can enter.\r\n\r\nThis was designed by a group called \"Swing Era Japan\".<br \/><br \/>\r\n<\/td><\/tr>\r\n<\/table>\r\n\r\nIf you like exploring, your onto a winner. As usual the problem is finding the diamonds in the rough, as there is an unimaginable ammount of content is second life and most of it is of poor quality.\r\n\r\nSecond life is also starting to suffer many of the same issues as the real world. They are trying to build roads that interconnect densely populated areas, but they are having trouble finding a route without uprooting people from their land. Linden labs are also trying to create areas of beauty such as parks, forests and other simulations so that people have quality locations to meet in and to promote a positive image of second life.\r\n\r\nAnother major issue that has come about is the Intellectual Property rights of in world items. Programmers are able to easily copy items that may have taken someone else a very long time to create with use of a modified viewer. Some people are then selling these items at knock down prices, creating a black market. These issues sometimes spill over from the real world with people using textures they have found by searching Google and reselling them as part of an object within second life. Music is also suffering IP issues as it can be easily played on any parcel of land by the land owner. All they need as an exernal URL to stream it from. Most land owners do not pay royalties for the music they play and as far as I am aware, this is completely un-policed.\r\n\r\nSecond life has given me lot but it was just a stepping stone to something better. For me, second life didn't allow me to design without limits. Mostly because it has an economy, an economy is built on rules and therefore limitations. I wanted a virtual environment that can extend and supplement my reality. I needed my own virtual space where rules are none existent unless I impose them. I needed my own simulation. Enter <a href=\"http:\/\/opensimulator.org\/\">openSim<\/a>. <a href=\"http:\/\/opensimulator.org\/\">openSim<\/a> is a complete virtual environment much the same as second life where essentially, I can run my own private second life server. I can use as much space as I like, build as big as I like in any way I want to. I'm not limited to a very small quantity of computer resources, I'm only limited by my hardware and how efficiently I use it. Slowly I have begun merging this with other applications that I use in the real world. I intend to blog about these uses I find for the tiny universe I have created and experiments I will run.\r\n\r\nWatch this space.","title":"Notes on a second life","status":"publish","name":"notes-on-a-second-life","type":"","tags":["Second Life","OpenSim"],"categories":["General"],"comments":[]}