{"date":"2014-04-09 07:00:00","content":"It all started with a cat and some plastic... <br \/><img src=\"\/uploads\/2014\/04\/reprap_mendel_felix_small.jpg\" alt=\"Felix helping with reprap assembly\" \/><p><img src=\"\/uploads\/2014\/04\/reprap_mendel_frame_small.jpg\" alt=\"Basic Mendel frame\" \/><\/p><p>In 2010 when Beth and I started building the reprap, we anticipated it would take us a month or two. We we're wrong. We had almost no tools, no work space and limited engineering knowledge. Sometimes because work was just too busy, we wouldn't touch the reprap for months at a time. The frame was completed by mid 2010. The x axis and x carriage were completed by the end of 2010 and by 2013 the reprap was working aside from some incredibly poor printing accuracy. It wasn't until this weekend just passed that I finally tweaked the reprap into having a good enough accuracy to print replacement and upgraded parts for itself. Now of course, the mendel reprap is outdated and many parts have been improved or are completely replaced in the latest available designs. It  will take several months of spare time to bring the printer up to date. I've already got a list of improvements to add including;<br \/><ol><li> - Moving both z axis motors up on top of the rep rap to improve print height and reduce problems with the two z axis worm gears getting out of sync.<\/li><li> - A small fan to cool the extruded plastic much quicker. This will also improve printing of bridges.<\/li><li> - Using a ribbon cable to replace all wires to the x carriage.<\/li><\/ol>I can't wait to see where 3D home printing is in another 4 years.<\/p><p><img src=\"\/uploads\/2014\/04\/reprap_mendel_printing_small.jpg\" alt=\"Reprap mendel with gear\" \/><\/p><p><img src=\"\/uploads\/2014\/04\/reprap_mendel_printing.gif\" alt=\"Reprap mendel with gear\" \/><\/p>","status":"publish","name":"reprap-4-year-project","title":"My Reprap Mendel","type":"","tags":["RepRap","Mendel","3D printer"],"categories":["General\/Techie"],"comments":[]}