{"date":"2012-11-05 21:34:06","content":"I wondered how long one needs to wait before owning the current worlds computer processing power for under $1000.\r\n\r\nA few studies have been done to measure the world's processing power. In 2007 the entire world's computer capacity measured at 6.4 x 10<sup>18<\/sup>instructions per second<sup><a href=\"http:\/\/www.uvm.edu\/~pdodds\/files\/papers\/others\/2011\/hilbert2011a.pdf\">[1]<\/a><\/sup>. as estimated by Martin Hilbert, et al. Unfortunately that's not really a useful measure of processing power. FLOP\/s would have been more useful as it relates to the useful work you can do.\r\n\r\nSo I'm going to have to do some estimating myself. The research firm <a href=\"http:\/\/www.canalys.com\/\">Canalys<\/a> have come up with a figure of 112 million PCS sold in 2011. I'm going to estimate (complete guess) the processing power of the average computer sold at 30GFLOP\/s. I'm basing that on an Intel Core i7 980 XE six core processor available in 2010 measuring at 109 GFLOP\/s. Most people are going to go for mid range processors though so that's where I get my 30GFLOP\/s from. I'm aware this does not include the graphics processing power. So we have a total of 112000000 x 30GFLOP\/s = 3360000000 GFLOP\/s or 3.4 ExaFLOP\/s.\r\n\r\nThis same processing power will be available in a laptop or smaller device by the year 2033<sup><a href=\"http:\/\/www.transhumanist.com\/volume1\/moravec.htm\">[2]<\/a><\/sup> as measure in MIPS. <b>So that's 26 years for the processing power of the entire planet to be condensed into a device that sits on your lap<\/b>. If you want to argue that my estimate of the worlds processing is off by a factor of 10 then make it 2037. This does however ignore any game changes such as quantum computing, optical computing, spintronics... the list goes on.\r\n\r\nAlso, that is just one data point and relies on moore's law, perhaps 26 years has been a constant since the dawn of computing, or perhaps it's a number that get's steadily smaller over time. If I find more data, I'll update this blog post.\r\n\r\nSources:\r\n[1] <a href=\"http:\/\/www.uvm.edu\/~pdodds\/files\/papers\/others\/2011\/hilbert2011a.pdf\">http:\/\/www.uvm.edu\/~pdodds\/files\/papers\/others\/2011\/hilbert2011a.pdf<\/a>\r\n[2] <a href=\"http:\/\/www.transhumanist.com\/volume1\/moravec.htm\">http:\/\/www.transhumanist.com\/volume1\/moravec.htm<\/a>","title":"Earths processing capacity in my lap","status":"publish","name":"the-worlds-processing-capacity","type":"","tags":["CPU","FLOPs","Futurism"],"categories":["General"],"comments":[]}