{"date":"2009-08-24 21:43:18","content":"From this day forth I see the Drobo as useful as volatile storage when it comes to long term storage of my data.\r\n\r\nHow it happened:\r\nI unplugged the Drobo from an old computer using the now ancient USB 1.1 and plugged it into my Ubuntu computer. The Ubuntu computer gave a message saying it couldn't mount the volume. So I plugged it into my laptop to see what Vista had to say, but unfortunately Vista refused to mount the drive as well. After checking the drive in Vista's disk manager I came to conclusion that Vista saw it as a RAW partition! It had completely forgotten that it was an NTFS partition so Vista didn't know what to do with it.\r\n\r\nMy immediate thought was the Drobo is going to start freeing up space and wiping the drives sector by sector. Fortunately I couldn't hear any disk activity so I thought to myself that I may be able to recover the data. I used a copy of EASUES Data Recovery to do a scan of the hard disk to find lost partitions. It took 48 hours to do the scan, which is ridiculous when you consider I only had 300GB of data on the Drobo and the Drobo's entire capacity was only 500GB, 48 hours is fairly ridiculous at 1.7Mb\/s.\r\n\r\nAt this point my laptop where I was recovering the data to, crashed. Not a problem as I had my initial scan saved so I could continue where I left off. I wandered off for 2 minutes to come back and find my computer had started a file system scan of the Drobo and it had attempted to repair damaged sectors!! This could be really good or really bad. After windows booted and I franticly continued the scan I ran into another problem! The scan had not remembered where it had stopped so I had to leave it running for a further 48 hours! This time around however I had the mortifying experience of watching the little blue lights go out one at a time on the Drobo's front panel. It appears that the file system \"fix\" that vista had run had in fact instructed the Drobo to truncate the \"problem\" parts of the disk. This consequently meant that I was running the scan for the second time and that this time the Drobo was probably slowly destroying my data. As it turned out the file system scan had destroyed a lot of data but in the end I managed to get a portion of my data back.\r\n\r\nImportant lessons:\r\n<ul>\r\n\t<li>If you delete something from a drobo, your data is gone... forever.<\/li>\r\n\t<li>If you Drobo file system gets damaged, do not let windows or any other operating system repair it or you will lose some or all of your data.<\/li>\r\n\t<li>The drobo is slow, you can't recover data in a timely manner (if you can recover it at all).<\/li>\r\n\t<li>Don't trust the Drobo, as it is only a single device it cannot provide an ultimate solution (or even a reliable one). I will be moving to some kind of distributed private cloud storage setup and will blog about that when I've got one going.<\/li>\r\n\t<li>During the time that I have owned the Drobo, it has failed twice. No other disks, flash drives or dvds have died in my house since I bought the drobo. So the Drobo fails more often than any of my other storage devices.<\/li>\r\n<\/ul>","title":"The Drobo - Recovering Data","status":"publish","name":"the-drobo-recovering-data","type":"","tags":["drobo","NTFS","Data Loss"],"categories":["Guides\/Fixes","Reviews\/Experience"],"comments":[{"author":"Craig Mayhew","authorEmail":"craig@mayhew.io","authorURL":"http:\/\/","authorIP":"86.7.228.177","timestamp":"2009-10-30 05:44:41","timestampGMT":"2009-10-30 04:44:41","comment":"Hi Chris,\r\n\r\nYes it was version 4.3.6 and in my case I was able to recover the file names. (I don't want to endorse this product as there are free alternatives, but it did work for me)\r\n\r\nUnfortunately the recovery has to be done with the drives in the drobo because the drobo does not use a specific form of RAID.","browser":"Mozilla\/5.0 (X11; U; Linux x86_64; en-GB; rv:1.9.0.14) Gecko\/2009090217 Ubuntu\/9.04 (jaunty) Firefox\/3.0.14"},{"author":"Chris Baude","authorEmail":"equifoto@embarqmail.com","authorURL":"http:\/\/www.equifoto.printroom.com","authorIP":"76.1.244.16","timestamp":"2009-10-30 05:26:40","timestampGMT":"2009-10-30 04:26:40","comment":"I read with interest your mention of Easeus used to attempt a recovery from a Drobo.\r\n\r\nCan I assume this was \"Data Recovery Wizard Pro v 4.3.6\"?  and were you able to recover files with their (or close to their) original names &amp; directory structure?\r\n\r\nWas the recovery done with all the drives in the Drobo, or did you reconnect them to individual SATA connectors and recreaated the array?  TIA, fot you forthcoming help and suggestions.\r\n\r\n-= Chris =-\r\nEquifoto(at)embarqmail.com","browser":"Mozilla\/4.0 (compatible; MSIE 8.0; Windows NT 6.0; Trident\/4.0; SLCC1; .NET CLR 2.0.50727; Media Center PC 5.0; InfoPath.2; .NET CLR 3.5.30729; .NET CLR 3.0.30729)"},{"author":"Dale Franklin","authorEmail":"dale.franklin@yahoo.com","authorURL":"http:\/\/none","authorIP":"65.111.172.189","timestamp":"2010-08-31 20:24:18","timestampGMT":"2010-08-31 19:24:18","comment":"Craig,\r\n\r\nI could use some adivce.  I have been using a Drobo for about 2 years now.  Really without any issue.\r\n\r\nI am not a tech genius, but evidently my drobo was shut down several times without being put into standby.  Now, it will not boot up and stay running.\r\n\r\nThere is one red light on. I replaced that drive hoping it would solve the problem.  It did not. The drobo still just boots up, tries to get started. Blue lights flicker.  It shows 3 green lights and 1 red, then it turns off.  Just what it did before I replaced the drive.\r\n\r\nIs there any way you know of to recover this data.  \r\n\r\nThanks,\r\n\r\nDale","browser":"Mozilla\/5.0 (Macintosh; U; Intel Mac OS X 10.6; en-US; rv:1.9.2.8) Gecko\/20100722 Firefox\/3.6.8"},{"author":"Craig Mayhew","authorEmail":"craig@mayhew.io","authorURL":"","authorIP":"93.97.160.59","timestamp":"2010-09-02 23:31:01","timestampGMT":"2010-09-02 22:31:01","comment":"Hi Dale,\r\n\r\nThe drobo is quite particular about how it likes to be turned off. Unfortunately if the drobo won't power up then I would talk to the drobo tech support. They will probably recommend you put all the drives into another drobo and they should then boot up. But I really would talk to them as if you do that wrong the second drobo may well start overwriting your data.\r\n\r\nI know the drobo is supposed to make data storage simple but I have found that most of the time, it  just causes people to trust it too much and they lose all their data. I can't stress how important it is to backup your data to a second device (a spare hard disk, another computer or even another drobo).","browser":"Mozilla\/5.0 (Windows; U; Windows NT 6.1; en-GB; rv:1.9.2.8) Gecko\/20100722 Firefox\/3.6.8 FirePHP\/0.4"},{"author":"Sean Wade","authorEmail":"info@24hourdata.com","authorURL":"http:\/\/www.24hourdata.com","authorIP":"71.170.116.70","timestamp":"2010-09-29 06:26:11","timestampGMT":"2010-09-29 05:26:11","comment":"Drobo like many NAS and RAID devices must be handled properly when facing data loss. Great point about never running Win Sys Repair tools. RAIDs are built for fault tolerance not redundancy unless using RAID 1. \r\n\r\nDrobos are very sensitive when a drive is failing or having config issues. Always have a solid backup in place with Drobos. If your data is not backed up then think twice about a DIY Recovery. We see Drobo drives quite often and they are high end recoveries to say the least.\r\n\r\nThat being said we are a big fan of the Drobo Drives and Technology.","browser":"Mozilla\/5.0 (Macintosh; U; Intel Mac OS X 10_6_3; en-us) AppleWebKit\/531.22.7 (KHTML, like Gecko) Version\/4.0.5 Safari\/531.22.7"},{"author":"Dave Lamont","authorEmail":"sjcabdriver@gmail.com","authorURL":"","authorIP":"173.61.202.108","timestamp":"2012-07-06 14:58:24","timestampGMT":"2012-07-06 13:58:24","comment":"I had a drobo. My battery backup unit failed, crashing the drobo. I called tech support @ drobo and walked me through all kinds of tests, etc. Long and short of it, file table is corrupt and cant be rebuilt, according to drobo. Well, there goes all my family vacation photos, wedding photos, etc. Damn worthless drobo. \r\nI now use Backlaze for my cloud backup. Very fast, very reliable. Wish I was using it before the damn drobo crapped out on me.","browser":"Mozilla\/5.0 (Windows NT 6.1) AppleWebKit\/536.11 (KHTML, like Gecko) Chrome\/20.0.1132.47 Safari\/536.11"}]}