{"date":"2008-04-27 11:48:12","content":"I've owned a drobo for 3 months now and so I thought I'd share my experience with this pioneering device.\r\n\r\nDay 1:\r\n\r\nFor those of you that aren't familiar with drobo; It is a device for keeping your data safe from corruption and drive failure. It plugs in via usb (or more recently ethernet) and merges all the drives you put into it into a large pool of protected storage (only ever insert empty drives in drobo becuase it automatically wipes data from drives when you plug them in for the first time). For me this consisted of a 200GB, a 250GB and a 500GB drive to start with. This gave me 417GB of protected storage.\r\n\r\nSetting up the drobo was easy. It was quick and painless. My probems began when I ordered two new 500GB drives. They arrived, I slotted one into drobo, the space immediately became available. The other I was keeping as a spare for if a drive fails in the future. This now gave me 882GB of protected storage. I transferred data from my previous storage mediums (a mixture of hard disks and dvds) and once done shut down my computer for the evening. All seemed well, I could finelly sleep at night knowing that a failed drive or dead disk sectors wouldn't haunt my nightmares any longer.\r\n\r\nDay 2:\r\n\r\nAfter a good nights sleep I woke up and switched on my computer to be greeted by a red light. The 500GB drive had failed. That' okay though because drobo spent the next 8 hours making sure my data was protected across the remaining 3 disks. After it had done this I plugged in the spare 500GB drive and cast the \"dead\" drive aside. Drobo sorted itself and all went back to normal with the data protected across all four drives. I turned my computer off and I went to sleep but couldn't help wondering why drobo had failed a brand new drive. I told myself it must have just been dodgy out of the box.\r\n\r\nDay 3:\r\n\r\nI woke up the next morning to find that when I powered on my pc drobo had failed the other new 500GB drive. I started to get a little worried at this point as I was fresh out of spare drives. I logged onto the drobo support site contacted support.\r\n\r\nDay 4:\r\n\r\nI got a reply asking for me to submit my diagnostics file. This file is encrypted so I could be handing over any information about anything that is on my computer or stored on my drobo and I wouldn;t even know. I wasn;t particulary happy about this but realised I had little choice if I wanted to find out why my drobo was eating drives.\r\n\r\nDay 5:\r\n\r\nI had a reply telling me that because of <a title=\"Samsung 500GB Drives (HD501LJ)\" href=\"http:\/\/na3.salesforce.com\/_ui\/selfservice\/pkb\/PublicKnowledgeSolution\/d?orgId=00D500000006kRy&amp;id=50150000000LKys&amp;retURL=%2Fsol%2Fpublic%2Fsolutionbrowser.jsp%3Fsearch%3D500gb%26cid%3D000000000000000%26orgId%3D00D500000006kRy%26t%3D4&amp;ps=1\">Samsung 500GB (HD501LJ)<\/a> not sticking to the rules when communicating via sata when they are powered on, drobo would think they were malfunctioning and fail them. This should be fixed in the next firmware release.\r\n\r\nWeeks Later:\r\n\r\nThe new firmware release fixed the problem and I'm now using the 500GB drives quite happily. The whole experience left me quite shaken and not so trusting in the drobo. If I had plugged in both the 500GB drives at the same time then drobo would have failed them both when it next turned on. This would have completely wiped out my data as drobo doesn't support multiple drive failures.\r\n\r\nThe lesson:\r\n\r\nIf your replacing drobo drives. Only ever replace them one at a time and do a complete shut down and reboot test to make sure the new drives are compatible. I've also found that the drobo can be very very slow at writing data and really doesn't like reading and writing at the same time. The drobo is a great product but I think we need to wait for the drobo 2.\r\n\r\nGood Points:\r\n<ul>\r\n\t<li>Stress free &amp; simple protected storage<\/li>\r\n\t<li>Can mirror data where there is free space to do so to provide extra redundency in case of two drive failures (This is an unconfirmed rumour, if anyone could shed some light on this I would be very grateful)<\/li>\r\n\t<li>Ability to upgrade capacity on the fly.<\/li>\r\n<\/ul>\r\nBad Points:\r\n<ul>\r\n\t<li>Can be really really slow at writing data to the drobo. I've exprienced speeds as slow as 2mb\/s for periods of over an hour. This was very very frustrating and I assume it's down to the procesor within the drobo not being able to keep up.<\/li>\r\n\t<li>Only a 1 year warranty offered by data robotics. This makes me a bit nervous as it is common for a good product to have a 3 year warranty and a high end product to have a 5 year warranty. Do you want to spend £250 on a drobo every 12months? I know I don't!<\/li>\r\n<\/ul>","title":"The Drobo and Me","status":"publish","name":"the-drobo-and-me","type":"","tags":["drobo","RAID","storage","HD501LJ","data robotics"],"categories":["Reviews\/Experience"],"comments":[]}