{"date":"2011-09-19 00:45:20","content":"Are we finally in the age of truelly unlimited storage? It would be nice but I think the encryption issue will let it down.\r\n\r\nBitcasa think they can offer you unlimited storage for $10 per month. They achieve this magic by using deduplication which ensures that data is never deduplicated across any of their servers. So if I upload an mp3 and you upload the same mp3 it only exists once on their disk. Dedupe actually takes it further and breaks every file into chunks and makes sure each chunk is only saved to disk once so if we both have a document where the front two pages are the same - those two pages will only be saved to disk once and so on.\r\n\r\nSo dedupe is great - but I want to encrypt all my data before it goes onto some untrusted server(s) and so should you. Encrypted data though is rather random and doesn't benefit at all from dedupe.\r\n\r\nSo bitcasa are using the following solution:\r\n\r\nIf you use something called Convergent Encryption - where you generate a key from the file you are encrypting. Then you can encrypt all your data with an individual encryption key for each file. To date this is as much info as they are willing to divulge. However this means you can only dedupe data on a per file basis, so my second example won't work.\r\n\r\nSo the only possibility I can think of is that they are breaking files into chunks on the client and encrypting each chunk individually before uploading it to their servers. This will work great but does mean you need to remember an awful lot of encryption keys (millions or possibly billions depending on the chunk size). And this does mean you will need to use Bitcasa's proprietary client. This means you won't see any web based access and you won't see many if any 3rd party applications for a long time.\r\n\r\nHowever that last paragraph is pure speculation at this point :) I've signed up for the beta and hope to have more info soon!","title":"Thoughts on Bitcasa's unlimited online storage","status":"publish","name":"thoughts-on-bitcasas-unlimited-online-storage","type":"","tags":["deduplication","bitcasa"],"categories":["General"],"comments":[{"author":"Craig Mayhew","authorEmail":"craig@mayhew.io","authorURL":"","authorIP":"93.97.160.59","timestamp":"2011-09-21 18:05:09","timestampGMT":"2011-09-21 17:05:09","comment":"I'm still not convinced they will have great joy storing compressed archives, images or video. So If I were to drop several terrabytes of compressed nightly snapshots - I'm sure they would be only to quick to put something in their terms and conditions to prevent me doing this.","browser":"Mozilla\/5.0 (Windows NT 6.1; WOW64; rv:6.0.2) Gecko\/20100101 Firefox\/6.0.2"}]}
