{"_id":{"$id":"51feb420560e7051629da802"},"date":"2010-06-13 13:09:47","content":"It's my last day in Germany today and before coming home I wanted to write about a few things they do (in my opinion) better here than we do in the UK.\r\n\r\n<strong>Prepay Fuel Stations<\/strong>\r\nOn the way into Germany we filled up at a \"prepay fuel station\" (This was actually in the netherlands and not in Germany) where you have to pay for fuel before you put it into your car. In the UK alot of people are stealing fuel by driving off without paying. The solution most companies have come up with in the UK was to have a number plate recognition computer that black lists a cars number plate if it drives off without paying. This prevents people from stealing twice but doesn't prevent them from stealing in the first place. Proffesional fuel thieves of course would have a fake number plate and would probably have a barrel in the back of the car so they can steal hundreds of litres of fuel in one go. In any case the prepay would fix all these issues and prevention is better than cure.\r\n\r\n<strong>Autobahn<\/strong>\r\nThe <a href=\"http:\/\/en.wikipedia.org\/wiki\/Autobahn#Germany_4\">autobahn<\/a> in many parts doesn't have a speed limit. It also doesn't have average speed check cameras in sections that do have speed limits. Despite the ability to drive as fast as you like there are relatively few fatalities on the autobahn. Some environmental groups have said that the higher speeds cause less efficient fuel usage and larger carbon footprints. However introducing a speed limit such as in the UK would mean journey times are longer and therfore cars are on the road for longer which increases congestion. Introducing a speed limit also means it needs to be inforced at additional cost. I personally always see people braking at speed cameras (even the average speed check cameras) we have in the UK which causes a larger carbon foot print. There are some stretches of road in the UK which would benefit from higher or complete removal of the speed limit and it would be good if we could put this to a public vote.\r\n\r\n<strong>Double decker trains<\/strong>\r\nTrains with two floors! Many parts of the German rail network are designed to have higher trains which are capable of having two floors. This doubles the per carriage capacity. Unfortunately in the UK this would be very expensive to introduce as we have so many bridges and tunnels in our rail network.\r\n\r\nThe trains are also open plan you can easily walk from one end of a train to other with no doors seperating the carriages. This makes policing a train much easier and increases overall capacity.\r\n\r\n<strong>Indoor cash machines<\/strong>\r\n<a href=\"http:\/\/en.wikipedia.org\/wiki\/Automated_teller_machine#Card_fraud\">Card fraud<\/a> is a major concern in the UK and this is due to many cash machines being outside. This is convenient as it prevents huge queues with the bank. However from what I have seen many German banks only have cash machines on the inside of the bank. To get into the secure area out of hours you have to swipe a credit or debit card that they accept and it will allow you in. This also means they can easily track who comes in and when.\r\n","title":"Thoughts on Germany","status":"publish","name":"thoughts-on-germany","type":"","tags":["prepay","autobahn","card fraud","German rail network","Improve the UK"],"categories":["General","Reviews\/Experience"],"comments":[]}