{"date":"2009-07-13 08:24:12","content":"When I have too many applications open or one of them eats all the memory I end up with a big chunk of my swap space used. The problem is that once I've closed a few programs or killed the offending program my computer still uses the swap space! I've read that the swap space will slowly be loaded back into RAM but only when it is next accessed. This results in sluggish system performance when the applications next read the memory in the swap space. To solve this problem you can empty the swap space and load it all back into RAM with one simple command. Please make sure you have enough RAM installed to load the memory in swap back into RAM...\r\n\r\nThis switches off swap memory and forces the system to load it back into RAM:\r\n<pre style=\"border: 1px solid #FFFFFF; padding: 5px; overflow:auto;\">\r\nsudo swapoff -a\r\n<\/pre>\r\n\r\nThis switches swap back on incase you run out of RAM in the future:\r\n<pre style=\"border: 1px solid #FFFFFF; padding: 5px; overflow:auto;\">\r\nsudo swapon -a\r\n<\/pre>\r\n\r\nSo now I can run those two commands, have the computer busy for 10-15 seconds and then know that it won't slow down again due to needing to access the swap (Unless it runs out of RAM again).","title":"Ubuntu 9.06: Load used swap space back into RAM","status":"publish","name":"ubuntu-9-06-load-used-swap-space-back-into-ram","type":"","tags":["Linux\/Ubuntu","Ubuntu 9.04","Virtual Memory","Swap Space","RAM"],"categories":["Linux\/Ubuntu"],"comments":[{"author":"alex","authorEmail":"a5b@rt.mipt.ru","authorURL":"","authorIP":"213.247.249.139","timestamp":"2009-12-03 15:45:00","timestampGMT":"2009-12-03 14:45:00","comment":"Hello.\r\nHow can I do the same without root access?","browser":"Opera\/9.80 (X11; Linux i686; U; en) Presto\/2.2.15 Version\/10.10"},{"author":"Craig Mayhew","authorEmail":"craig@mayhew.io","authorURL":"http:\/\/","authorIP":"86.7.228.177","timestamp":"2009-12-04 01:41:33","timestampGMT":"2009-12-04 00:41:33","comment":"Unfortunately you will need root access to run that command.","browser":"Mozilla\/5.0 (Windows; U; Windows NT 6.1; en-GB; rv:1.9.1.5) Gecko\/20091102 Firefox\/3.5.5"}]}