{"_id":{"$id":"51feb420560e7051629da522"},"date":"2008-11-11 01:43:35","content":"After installing the latest version of wine via command line and rebooted ubuntu, I was greeted by this message after typing my user\/pass and logging in.\r\n\r\n\"User's $HOME\/.dmrc file is being ignored. This prevents the default sessin and language from being saved. File should be owned by user and have 644 permissions. User's $HOME directory must be owned by user and not writable by other users.\"\r\n\r\nI could login in OK, but something was clearly wrong and needed fixing. Change my name to your user name. Here's how to fix it:\r\n<pre class=\"alt2\" style=\"border: 1px inset; margin: 0px; padding: 6px; overflow: auto; width: 99%; text-align: left;\" dir=\"ltr\">sudo chmod 644 \/home\/craig\/.dmrc\r\nsudo chown craig \/home\/craig\/.dmrc\r\nsudo chmod -R 700 \/home\/craig\r\nsudo chown -R craig \/home\/craig<\/pre>\r\n(If you get permission errors when trying this then drop out of the GUI and into recovery mode. This can be done by pressing Esc on the grub screen and selecting the latest recovery version)\r\n\r\nI'm not sure precisely why this error message started appearing, but it had something to do with the way I installed the latest wine. I did via command line and not by the package manager.","title":"Ubuntu 8.04: $HOME\/.dmrc File is Being Ignored","status":"publish","name":"ubuntu-804-homedmrc-file-is-being-ignored","type":"","tags":["Ubuntu 8.04","Hardy Heron"],"categories":["Guides\/Fixes","Linux\/Ubuntu"],"comments":[{"author":"iain","authorEmail":"iainbarton01@yahoo.co.uk","authorURL":"","authorIP":"92.236.65.11","timestamp":"2009-04-07 16:13:39","timestampGMT":"2009-04-07 15:13:39","comment":"Well done.\r\n\r\nYou fixed the start up message problem.\r\n\r\nBut this appears to have fixed a problem ...\r\nWhenever I opened up the \"explorer browse dialogue box\" in microsoft office it would crash.\r\n\r\nClearly one of directories it was trying to open it did not have permission.\r\n\r\nregards\r\n\r\niain","browser":"Mozilla\/5.0 (X11; U; Linux x86_64; en-US; rv:1.9.0.8) Gecko\/2009032712 Ubuntu\/8.04 (hardy) Firefox\/3.0.8"}]}