{"_id":{"$id":"51feb420560e7051629da55d"},"date":"2009-05-30 15:23:20","content":"If you have Ubuntu 8.04 LTS installed but have decided that the speed improvements and nicer interface for 9.04 are just too good to wait for the next LTS, you will need to do the following:\r\n\r\n\"System\" -&gt; \"Adminstration\" -&gt; \"Software Sources\"\r\n\r\nClick the Updates Tab. Set \"Release Upgrade\" drop down to \"Normal releases\", click \"Close\". This will allow you to upgrade to versions of Ubuntu which do not come with long term support (LTS).\r\n\r\nRun the Update Manager. Click \"Distribution Upgrade\". This will begin the upgrade to Ubuntu 8.10.\r\n\r\nDuring the upgrade process it may ask you to replace a few files that it detects you have customised. For me it asked to overwrite my cutomised printer setup and also undo modification I had made to the way ubuntu uses virtual memory. Don't forget to make a note of these as you will need to add this customisations again manually later if you still require them. When prompted, restart.\r\n\r\nAfter rebooting, my copy of ubuntu crashed during the boot process due to a problem with the latest kernel it had installed. It crashed on boot due to issues with not being able to mount the root file system. This was easily solved by pressing escape to view the grub menu during the boot process. I then selected the older kernel version from the list of available kernels. It then booted happily into Ubuntu 8.10!\r\n\r\nAt this stage I took the time to notice the better network interface GUI, better support for wireless and VPN connections. It wasn't too long before a message popped up telling me that Nvidia had some new drivers for my graphics card! This is excellent news for me because previously I had a script to recompile my graphics drivers each time a new kernel was installed due to the graphics card being so new. However we don't want to stop here, we're going for Ubuntu 9.04!\r\n\r\nOnce again run the \"Update Manager\" found under \"System\"-&gt;\"Administration\". Click \"Upgrade\". It will prompt you with a few messages. Click Start and Upgrade where necersary.\r\n\r\nIf the process appears to get stuck downloading a particular package when it's at the stage \"Getting New Packages\" then click cancel. Go back to the update manager and start the upgrade process again. It will start from where it left off and won't redownload the packages it has already downloaded.\r\n\r\nOnce it has finished upgrading, remove obsolete packages and restart when prompted.\r\n\r\nThere you have it! You should now be running ubuntu 9.04!","title":"Upgrade Ubuntu 8.04 LTS to 9.04","status":"publish","name":"upgrade-ubuntu-804-lts-to-904","type":"","tags":["Ubuntu 8.10","Ubuntu 8.04 LTS","Ubuntu 9.04"],"categories":["Guides\/Fixes","Linux\/Ubuntu"],"comments":[]}