{"_id":{"$id":"51feb41f560e7051629da506"},"date":"2007-12-01 14:58:45","content":"Most internet providers now provide free wireless routers when you sign up for an internet connection. The problem is that people don't know the risks of having a wireless network on it's default configuration. Wireless networks use several different methods to keep your network secure and intruder free. The more of these methods you have in place, the more secure your network is.\r\n\r\n<strong>Hardware<\/strong>\r\nOld wireless equipment (before 2003) probably won't support a strong enough encryption level to protect your network from intruders. Also if your hardware does not support at least 802.11g then chances at that it won't support strong enough encryption.\r\n\r\n<strong>Firmware<\/strong>\r\nUpgrade the software on your wireless access point to the latest that the manufacturer has available. This could improve range, speed and power efficiency as well as security. The latest firmware updates can normally be found on the manufacturers website. Even if you have just bought your equipment new from the shop and think the CD it came with must be the most up to date software; there may well have been a firmware release while it was still sitting on the shelf.\r\n\r\n<strong>Encryption<\/strong>\r\nNow that you have hardware that was manufactured no earlier than 2003 and have the latest firmware you should make sure your running the strongest encryption that your hardware supports. At the time of writing; WPA encryption is currently secure. WEP encryption is easily crackable and should never be used in a network.\r\n\r\n<strong>Keys \/ Passwords<\/strong>\r\nYou could be running the most uncrackable encryption in the world but if you've chosen something like '123456' or 'mousemat' for your encryption key then you may aswell be using morse code. Simple one word keys can be guessed by what's called called a dictionary attack. A dictionary attack is when an automated program is used to try and guess your network key by trying every word in the dictionary (and often combinations of words e.g. yellowstone). Your network key should be made from random letters and numbers. Some manufactures place the default network key on a sticker on the side of the access point, if yours has a sticker then make sure it is not easily visible from a window.\r\n\r\n<strong>SSID<\/strong>\r\nYour SSID is the name that your wireless access point will broadcast. It should not contain the name or make of your wireless access point or the name of your internet provider. For instance if your access points SSID is 'SKY7761' then they instantly know you have a router from Sky and will try to find known flaws in the security software using a search engine.\r\n\r\n<strong>MAC Filter<\/strong>\r\nAll hardware uses a mac address to identify itself no the network. The mac address of each wireless card \/ wireless computer should be printed on it's sticker. It is possible to find out a devices mac address without it being printed on the device but this is too in depth to cover in this Wireless Networking Security 101. If you know all the MAC addresses for your devices then you can add them to the wireless access point's MAC filter. When the MAC filter is turned on it will prevent any devices from connecting to the wireless network without an approved MACr address.\r\n\r\n<strong>Turn it off<\/strong>\r\nIf you don't use your wireless internet at night then use an electrical timer to turn off your access point at night time. This saves you money on your lecky bill and if your wireless network isn't powered on then it should be 100% hacker proof!","title":"Wireless Networking Security 101","status":"publish","name":"wireless-networking-security-101","type":"","tags":["wifi","security","wep","wpa"],"categories":["Guides\/Fixes"],"comments":[]}