{"date":"2013-03-10 19:14:44","content":"For this test I will be running FreeBSD in a VirtualBox virtual machine. These instructions will work regardless of this.<br /><br />Download the 64bit iso of FreeBSD. I am using version 9.1.<br /><br />Install FreeBSD form the livecd. I decided to drop the games from the install.<br /><br />I initially tried to get a bootable zfs partition going, but after several hours of failed attempts using this guide: <a href=\"https:\/\/wiki.freebsd.org\/RootOnZFS\/GPTZFSBoot\/9.0-RELEASE\">https:\/\/wiki.freebsd.org\/RootOnZFS\/GPTZFSBoot\/9.0-RELEASE<\/a>, I decided I would leave plenty of drive space spare when partitioning the disk. I set 64GBs up for the operating system and left the rest spare for the ZFS.<br /><br />Note: I have used da0 for my drive as it is a SAS drive. If you are using SATA then you will need ada0.<br /><br /> # gpart add -t freebsd-zfs -l disk1 da0<br /><br />So, assuming you have booted freebsd, you now need to create the zfs volume.<br /><br /> # kldload opensolaris<br /> # kldload zfs<br /> # zpool create -m \/zfs disk1 da0p1<br /><br />Enable dedupe using fletcher4, verify hashes when writing to disk and enable compression:<br /> # zfs set dedupe=on disk1<br /> # zfs set dedup=fletcher4,verify disk1<br /> # zfs set compression=gzip disk1<br /><br />We will want it to mount the volume every time the system boots<br /><br /> # echo 'zfs_enable=\"YES\"' >> \/etc\/rc.conf<br /><br />Great, now we need something like network file sharing for windows so I can use it in a windows environment and just dump backups to it. (Prepare for a lot of compiling and a long wait)<br /><br /> # cd \/usr\/ports\/<br /> # portsnap fetch<br /> # portsnap extract<br /> # portsnap update<br /> # cd net\/samba36\/<br /> # make install<br /><br />You will be asked for a whole bunch of optional packages, just stick with the defaults as the menus appear.<br /><br />You will be wanting Samba to available after reboot:<br /> # echo 'samba_enable=\"YES\"' >> \/etc\/rc.conf<br /><br />I am sharing my \/zfs directory and have setup my  smb.conf like so:<br /> # vi \/usr\/local\/etc\/smb.conf<br /><img src=\"\/uploads\/2013\/03\/smbconf.png\" alt=\"smbconf\" title=\"smbconf\" width=\"356\" height=\"179\" class=\"size-full wp-image-1855\" \/><br /><br />In here goes your password:<br /> # vi \/usr\/local\/etc\/samba\/smbpasswd<br /><br />Warning:<br />Do not ever use a ZFS partition for SWAP, do not place any swap files within a ZFS filesystem. The reason for this is that ZFS requires a fair amount of RAM (some argue over 1GB for every 1TB of unique data on disk). If the data ZFS keeps in RAM falls into swap then your system will very quickly ground to a halt and slowly consume all it's RAM.<br /><br />Further reading:<br />https:\/\/wiki.freebsd.org\/RootOnZFS\/GPTZFSBoot\/9.0-RELEASE<br />http:\/\/www.datadisk.co.uk\/html_docs\/sun\/sun_zfs_cs.htm<br />https:\/\/wiki.freebsd.org\/ZFSQuickStartGuide<br />http:\/\/www.freebsd.org\/doc\/handbook\/filesystems-zfs.html","title":"ZFS on FreeBSD","status":"publish","name":"zfs-on-freebsd","type":"","tags":["ZFS"],"categories":["General\/Techie"],"comments":[]}